[
    {
        "name": "TUMO Editor",
        "src": "https://www.youtube.com/embed/8DnxyEKnW2s?si=N0AWH0g0TwJxEQdJ",
        "description": "This is the web app that I am most proud of creating in my most recent position. At TUMO, we had learning modules where students would learn programming, but the coding editor was external and had no connection to our platform. One day, I had some free time and created a prototype for an in-house code editor that automatically tests the students' code, gives them custom feedback, and autocompletes their code. I showed the prototype to the Head of the team, Project Managers, and Senior Software Engineers, and they really liked it, so we decided to work on it. I successfully developed the editor and launched it in 5 countries across multiple programming learning modules. This coding editor saves 2+ days of waiting for the students because they don't have to wait for a human to examine their code, and it significantly reduces staff workload. I also presented the tool and all of its features to the CEO, workshop leaders, and coaches."
    },
    {
        "name": "Level Designer",
        "src": "https://www.youtube.com/embed/7QIItWS6bZA?si=5t0tx6ZEXNHRQ5bn",
        "description": "This is my last project I completed when working at TUMO using TypeScript, Vue.js, Three.js and Vite. It introduces students to level design in game development. It has clear requirements for the student to build the level upon, for example checking how many jumps it would take to get from the start to the end (for which I use a custom pathfinding algorithm)."
    },
    {
        "name": "Time Signature",
        "src": "https://www.youtube.com/embed/lIdGkP2Thiw?si=x-JF-Cxh_a990a3D",
        "description": "This is a tool that I developed while working at TUMO with the help of an Audio Engineer, Project Managers, UI Designers, and more. It is an educational tool teaching a concept in Music called Time Signature. It has a thorough walkthrough and explanation of the concept, along with how to use the tool. As you can see in the recording, it has separations in the timeline and beats under it, and the student is supposed to activate a 'beat' button with the correct timing."
    },
    {
        "name": "Motion Designer",
        "src": "https://www.youtube.com/embed/50jYTwKaYXg?si=BmK5UCtX8FWxBs8u",
        "description": "This is a tool that I've developed to introduce students to the basics of motion design and keyframes. The student is tasked with moving the keyframes so the robot collects 2 items falling from the sky."
    },
    {
        "name": "Climate Quiz",
        "src": "https://www.youtube.com/embed/6imfQQk50Ac?si=GAikMGKuGFO2VWIY",
        "description": "This is one of the first tools that I developed while working on the TUMO Climate program for Paris. It quizzes students on different topics and gives them a result based on their answers. It's reused in multiple places in the program to teach students about the impact of their actions on the climate. TUMO Climate was the first big project that I worked on at TUMO, I've developed numerous educational games and tools to make Climate Education Interactive, Fun and Collaborative."
    },
    {
        "name": "Fullsize.am",
        "src": "https://fullsize.am",
        "description": "When working at DigitalBrains, one of the biggest projects assigned to me was creating a PHP Web Scraper which scrapes products from vega.am to fullsize.am. Both parties (stores) were aware of this, and after they provided us with the authentication details, I started working on it. I used PHP, cURL, OpenCart, and cron jobs to achieve this goal. These scripts enabled live synchronization of over 20,000 products from one vega.am to fullsize.am in real time, without using any pre-made APIs."
    },
    {
        "name": "Titan Arena",
        "src": "https://www.youtube.com/embed/ONQ5YIXadGA?si=Y63gqiTH-Duj2Gej",
        "description": "This is one of the first projects I've worked on. It is a VR game where you fight huge Titans. I developed gameplay features, tools, and a VR UI menu for it using Unity and C#. I also used Perforce for version control and collaboration."
    }
]
